# GetPtL3D

## Description
Procedure GetPtL3D creates a temporary &quot;rubberband&quot; 3D line from a specified point to the user selected end point. This cannot be used if there is a function anywhere in the calling chain.

```pascal
PROCEDURE GetPtL3D(
				p1        : REAL;
				VAR p2    : REAL;
				useWPOnly : BOOLEAN);
```

```python
def vs.GetPtL3D(useWPOnly, callback):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p1|REAL|Coordinates of line start point.|
|p2|REAL|Returns coordinates of mouse click.|
|useWPOnly|BOOLEAN|TRUE if the returned point have to be on the active Working Plane. Snapping to arbitrary 3D geometry will produce vertical projection result on the WP; FALSE if the point can be arbitrary 3D point (produced, for example, by snapping to a 3D geometry)|

## Remarks
In Python this function will _NOT_ block execution. It will execute a callback function with the resulted line (two points as callback function parameters).

## Examples
on sample is similar to the sample in GetPt.

```pascal
GetPtL3D(pt1.x, pt1.y, pt1.z, pt2.x, pt2.y, pt2.z, false);
{GetPtL(pt1.x, pt1.y, pt2.x, pt2.y);}
```
```python
import vs

# Procedure GetPtL3D creates a temporary &quot;rubberband&quot; 3D line from
# a specified point to the user selected end point.
def handle_object(objHandle):
    vs.Message('Processing: ' + str(objHandle))

useWPOnly = True
callback = handle_object

vs.GetPtL3D(useWPOnly, callback)
```

## See Also
VS Functions:
GetPt |
GetPtL |
GetPt3D |
GetPtL3D |
GetLine |
GetLine3D |
GetRect |
GetRect3D |
TrackObject

## Version
Availability: from Vectorworks 2010

## Category
* User Interactive